webwork/instruction-TA.org
#+TITLE: Instructions for TAs
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Video instruction
- https://youtu.be/Qfb0-eMak3g

* Main duties
** Beginning of the semester
- Add students to the webwork courses.
- Import homework sets.
** During the semester
- Change homework dues if requested by professors.
- Answer questions from students.
** End of the semester
- Send the final homework scores to the professors at the end of
  the semester.

* Class webpages
- Your classes are listed here. https://webwork.skku.edu

* How to add students to the system
- You can add one student at a time manually or many students at once using a cvs file.
- To do this, first login to the webwork class homepage where you want to add students.
  
** Adding one student at a time
    1. Click =Classlist Editor= under =Instructor Tools= on the side bar.
    2. Click =Add= tap.
    3. Enter the number of students you want to add and click =Take Action!=.
    4. Enter students' information.
** Adding many students at once
*** Classlist files
- In order to add many students at once, you need to create a classlist file,
  which is a file with extension =lst=. 
- You can create a classlist file using Excel as follows.
*** Creating a classlist file (.lst file) using Excel
    1. Create an empty Excel file.
    2. Enter the student ids in the 1st and 9th columns.
    3. Enter the student names in the 2nd column. (*Important: Student names must be in English, not in Korean.*)
    4. Enter the letter =C= in the 4th column.
    5. Enter the email addresses in the 8th column.
    6. For example, if you have an excel file like [[file:sample_classlist.xlsx][this one]], you should make an
       excel file like [[file:sample_classlist_changed.xlsx][this one]].
    7. Save the new excel file as a cvs file (.cvs). You should get a file like [[file:sample_classlist_changed.csv][this]].
    8. Find the file in your folder and change the extension from =.cvs= to =.lst=. The final file must be something like [[file:sample_classlist_changed.lst][this]].
*** Adding students
    1. Login to Webwork.
    2. Click =File Manager= under =Instructor Tools= on the side bar.
    3. Upload the lst file in =templates= folder.
    4. Click =Classlist Editor=  under =Instructor Tools= on the side bar.
    5. Click =Import= tap and select the classlist file that you created above.
    6. Click =Take Action!=.
* Importing homework sets
   1. Click =Hmwk Sets Editor=  under =Instructor Tools= in the side bar.
   2. Click =Import= tap.
   3. For the first line =Import how many sets?=, select =multiple sets=.
   4. For the second line =Import from where?=, select the 14 files
      =sethw1.def=, ..., =sethw14.def=. (You can use the shift key to select multiple files here.)
   5. Select =all current users= in the list dropdown button saying =Assign this set of which users?=.
   6. Click =Take Action!=.
   7. It will show 14 homework sets.
* Changing homework dates
   1. Click =Hmwk Sets Editor=  under =Instructor Tools= in the side bar.
   2. Click the pencil icon next the homework set you want to edit.
   3. Change the dates and click =Take Action!=.
* Scoring tools (at the end of the semester)
   1. This should be done after the due of the final homework assignment.
   2. Click =Scoring Tools= under =Instructor Tools= in the side bar.
   3. Select all homework assignments and clink  =Score selected sets and save to=.
   4. A cvs file is created and you can download it.
   5. Open the cvs file using Excel. If you cannot open the cvs file, change the
      extension to =.txt= and then try it again.
   6. Make an excel file that contains only 2 columns: Student ID and =%scores=.
   7. Send this excel file to the professor of your class.
      
* Instructions for students and professors
- The instructions below contain everything students and professors need to know.
- If they have questions about the webwork system, you can answer them using these instructions.
- [[file:instruction-student.org][Instructions for Students]]
- [[file:instruction-professor.org][Instructions for Professors]]

